In [1]:
import numpy as np
import pandas as pd

In [2]:
mck = pd.read_csv('mckinsey.csv')

In [3]:
mck

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

### ASSIGNMENT

In [ ]:
#1

In [214]:
data = {
    'name': ['Elon', np.nan, 'Bill', 'Falguni'],
    'gender': ['M', np.nan, 'M', np.nan],
    'income': [53000.0, 28000.0, 25000.0, 44000.0]
}

df = pd.DataFrame(data)

In [215]:
df

      name gender   income
0     Elon      M  53000.0
1      NaN    NaN  28000.0
2     Bill      M  25000.0
3  Falguni    NaN  44000.0

In [211]:
def is_null(x): 
    return sum(x.isnull())

In [219]:
df.apply(is_null, axis=0)

name      1
gender    2
income    0
dtype: int64

In [227]:
is_null(df)

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [3]:
#2
data = {
    'name': ['Elon', 'Jeff', 'Bill', 'Falguni'],
    'gender': ['M', 'F', 'M', 'F'],
    'income': [53000.0, 28000.0, 25000.0, 44000.0]
}

df = pd.DataFrame(data)

In [4]:
df

      name gender   income
0     Elon      M  53000.0
1     Jeff      F  28000.0
2     Bill      M  25000.0
3  Falguni      F  44000.0

In [5]:
df.groupby(['gender'])['income']

In [25]:
a = df.groupby(['gender'])['income'].aggregate(['mean'])
type(a)

pandas.core.frame.DataFrame

In [27]:
df.groupby('gender').mean('income')

         income
gender
F       36000.0
M       39000.0

In [23]:
a

           mean
gender
F       36000.0
M       39000.0

In [ ]:
# 3

In [128]:
data = {
    'roll_no': [1, 2, 1, 3, 1, 3, 3, 3, 2, 2, 1, 2],
    'subject': ['NN', 'DL', 'ML', 'Prob', 'DL', 'ML', 'DL', 'NN', 'NN', 'Prob', 'Prob', 'ML'],
    'marks': [97, 63, 63, 71, 64, 90, 66, 46, 74, 62, 94, 67]
}

df = pd.DataFrame(data)

In [124]:
df

    roll_no subject  marks
0         1      NN     97
1         2      DL     63
2         1      ML     63
3         3    Prob     71
4         1      DL     64
5         3      ML     90
6         3      DL     66
7         3      NN     46
8         2      NN     74
9         2    Prob     62
10        1    Prob     94
11        2      ML     67

In [129]:
max_marks = df.groupby('subject')['marks'].max()

In [130]:
max_marks

subject
DL      66
ML      90
NN      97
Prob    94
Name: marks, dtype: int64

In [131]:
max_marks = max_marks.reset_index()

In [134]:
max_marks

  subject  marks
0      DL     66
1      ML     90
2      NN     97
3    Prob     94

In [138]:
 max_marks.merge(df,on=['subject','marks'] )

  subject  marks  roll_no
0      DL     66        3
1      ML     90        3
2      NN     97        1
3    Prob     94        1

In [143]:
result =  max_marks.merge(df,on=['subject','marks'] )

In [144]:
result

  subject  marks  roll_no
0      DL     66        3
1      ML     90        3
2      NN     97        1
3    Prob     94        1

In [ ]:
#4

In [149]:
sales = pd.read_csv('sales.csv')

In [150]:
sales

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom
...,...,...,...,...,...,...,...,...
1067366,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
1067367,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
1067368,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
1067369,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France
1067370,581587,POST,POSTAGE,1,2011-12-09 12:50:00,18.00,12680.0,France

In [156]:
sales.groupby('StockCode')['Description'].value_counts().sort_values(ascending=False)

StockCode  Description
85123A     WHITE HANGING HEART T-LIGHT HOLDER    5817
22423      REGENCY CAKESTAND 3 TIER              4412
85099B     JUMBO BAG RED RETROSPOT               3444
84879      ASSORTED COLOUR BIRD ORNAMENT         2958
47566      PARTY BUNTING                         2765
                                                 ...
85036B     check                                    1
35956      lost                                     1
35963      checked                                  1
35965      dotcom                                   1
21702      No Stock                                 1
Name: Description, Length: 6570, dtype: int64

In [158]:
sales.groupby('StockCode')['Description'].count().sort_values(ascending=False)

StockCode
85123A    5829
22423     4423
85099B    4216
21212     3318
20725     3259
          ...
21048        0
21047        0
84389        0
84394        0
21083        0
Name: Description, Length: 5305, dtype: int64

In [162]:
sales.groupby('Description')['Quantity'].sum().sort_values(ascending = False)

Description
WORLD WAR 2 GLIDERS ASSTD DESIGNS     108545
WHITE HANGING HEART T-LIGHT HOLDER     93050
ASSORTED COLOUR BIRD ORNAMENT          81306
JUMBO BAG RED RETROSPOT                78090
BROCADE RING PURSE                     70700
                                       ...
Unsaleable, destroyed.                -15644
missing                               -16467
printing smudges/thrown away          -19200
given away                            -20000
?                                     -26757
Name: Quantity, Length: 5698, dtype: int64

In [ ]:
#5

In [163]:
data = {
    'cust_id': [101, 102, 103, 104],
    'name': ['rick', 'morty', 'pickle', 'jerry'],
}

df = pd.DataFrame(data)

In [164]:
df

   cust_id    name
0      101    rick
1      102   morty
2      103  pickle
3      104   jerry

In [165]:
df.isin([101, 102, 120])

   cust_id   name
0     True  False
1     True  False
2    False  False
3    False  False

In [166]:
df.isin({'cust_id': [101, 102]})

   cust_id   name
0     True  False
1     True  False
2    False  False
3    False  False

In [167]:
df.isin(df.cust_id)

   cust_id   name
0     True  False
1     True  False
2     True  False
3     True  False

In [169]:
df.name.isin('rick')

TypeError: only list-like objects are allowed to be passed to isin(), you passed a [str]

In [168]:
df.name

0      rick
1     morty
2    pickle
3     jerry
Name: name, dtype: object

In [ ]:
df.name.isin('rick')

In [172]:
df

   cust_id    name
0      101    rick
1      102   morty
2      103  pickle
3      104   jerry

In [179]:
df['name'][0].isin(df.name)

AttributeError: 'str' object has no attribute 'isin'

In [180]:
df['name']

0      rick
1     morty
2    pickle
3     jerry
Name: name, dtype: object

### ADDITIONAL PROBLEM

In [ ]:
#1

In [181]:
data = {
    'ord_no': [70001, 70009, 70002, 70004, 70007, 70005, 70008, 70010, 70003, 70012, 70011, 70013],
    'purch_amt': [150.50, 270.65, 65.26, 110.50, 948.50, 2400.60, 5760.00, 1983.43, 2480.40, 250.45, 75.29, 3045.60],
    'ord_date': ['2012-10-05', '2012-09-10', '2012-10-05', '2012-08-17', '2012-09-10', '2012-07-27', '2012-09-10', '2012-10-10', '2012-10-10', '2012-06-27', '2012-08-17', '2012-04-25'],
    'customer_id': [3005, 3001, 3002, 3009, 3005, 3007, 3002, 3004, 3009, 3008, 3003, 3002],
    'salesman_id': [5002, 5005, 5001, 5003, 5002, 5001, 5001, 5006, 5003, 5002, 5007, 5001]
}

df = pd.DataFrame(data)

In [182]:
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001

In [186]:
df.groupby(['salesman_id','customer_id'])['ord_no'].count().reset_index()

   salesman_id  customer_id  ord_no
0         5001         3002       3
1         5001         3007       1
2         5002         3005       2
3         5002         3008       1
4         5003         3009       2
5         5005         3001       1
6         5006         3004       1
7         5007         3003       1

In [ ]:
#2

In [187]:
data = {
    'name': ['Bruno', 'Ariana', 'Harry', 'Selena', 'Weeknd'],
    'gender': ['M', 'F', 'M', 'F', 'M'],
    'income': ['low', 'high', 'medium', 'medium', 'medium']
}

df = pd.DataFrame(data)

In [188]:
df

     name gender  income
0   Bruno      M     low
1  Ariana      F    high
2   Harry      M  medium
3  Selena      F  medium
4  Weeknd      M  medium

In [190]:
df.groupby('income').count()

        name  gender
income
high       1       1
low        1       1
medium     3       3

In [201]:
a = df[df['income']=='medium'].count()[0]
a

3

In [202]:
b = df['income'].count()
b

5

In [203]:
a/b*100

60.0